#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with google_container_cluster.base,
  on main.tf line 17, in resource "google_container_cluster" "base":
  17:   enable_binary_authorization = true

Deprecated in favor of binary_authorization.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_container_cluster.base: Refreshing state... [id=projects/jithin-allex-cloud-dev/locations/us-central1/clusters/allex-gke-test-01]
google_binary_authorization_policy.image_policy: Refreshing state... [id=projects/jithin-allex-cloud-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_node_pool.node_pools["allex-generic-pool-01"] will be created
  + resource "google_container_node_pool" "node_pools" {
      + cluster                     = "allex-gke-test-01"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = 32
      + name                        = "allex-generic-pool-01"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = [
          + "us-central1-f",
        ]
      + operation                   = (known after apply)
      + project                     = "jithin-allex-cloud-dev"
      + version                     = "1.25.12-gke.500"

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 1
          + min_node_count  = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = "cos_containerd"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = "svc-gke-nodes-local-svc-account@jithin-allex-cloud-dev.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "60m"
          + update = "120m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with google_container_cluster.base,
  on main.tf line 17, in resource "google_container_cluster" "base":
  17:   enable_binary_authorization = true

Deprecated in favor of binary_authorization.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`, Working Directory: ``, Workflow: `gcp_bootstrap_gke_cluster-1`*